wagiminator/Development-Boards/STC8H8K64U_DevBoard/software/pwm_fade/include/gpio.h
// ===================================================================================
// Basic GPIO, PWM and ADC Functions for STC8H8KxxU Microcontrollers          * v1.0 *
// ===================================================================================
//
// Pins must be defined as P10, P11, P12, etc. - e.g.:
// #define PIN_LED P33      // LED on pin P3.3
//
// Functions available:
// --------------------
// PIN_input(PIN)           set PIN as INPUT (high impedance, no pullup) (*)
// PIN_input_PU(PIN)        set PIN as INPUT with internal PULLUP
// PIN_output(PIN)          set PIN as OUTPUT (push-pull)
// PIN_output_OD(PIN)       set PIN as OUTPUT (open-drain, no pullup)
// PIN_output_OD_PU(PIN)    set PIN as OUTPUT (open-drain, internal pullup)
// PIN_bidirect(PIN)        set PIN as quasi-bidirectional I/O (weak pull-up)
//
// PIN_pullup(PIN)          enable internal 4k1 PULLUP on PIN
// PIN_pulloff(PIN)         disable internal 4k1 PULLUP on PIN (*)
// PIN_fast(PIN)            set fast level shifting on PIN
// PIN_slow(PIN)            set slow level shifting on PIN (*)
// PIN_enable(PIN)          enable digital input on PIN (*)
// PIN_disable(PIN)         disable digital input on PIN
// PIN_strong(PIN)          set enhanced drive current ability on PIN
// PIN_weak(PIN)            set general drive current ability on PIN (*)
// PIN_ST_enable(PIN)       enable schmitt trigger function on PIN (*)
// PIN_ST_disable(PIN)      disable schmitt trigger function on PIN
//
// PIN_low(PIN)             set PIN output value to LOW
// PIN_high(PIN)            set PIN output value to HIGH (*)
// PIN_toggle(PIN)          TOGGLE PIN output value
// PIN_read(PIN)            read PIN input value
// PIN_write(PIN, val)      write PIN output value (0 = LOW / 1 = HIGH)
//
// PIN_asm(PIN)             convert PIN for inline assembly: setb PIN_asm(PIN_LED)
// PIN_set(PIN)             convert PIN for direct manipulation: PIN_set(PIN_LED) = 1;
//
// PWM_init()               init PWMA timer
// PWM_start(PIN)           start PWM output on PIN (P10 - P27, P33, P34 only)
// PWM_stop(PIN)            stop PWM output on PIN
// PWM_write(PIN, val)      set PWM output active level duty cycle on PIN (0 - 255)
//
// ADC_init()               init and enable ADC
// ADC_enable()             enable ADC
// ADC_disable()            disable ADC
// ADC_fast()               set ADC fast mode (less accurate) (*)
// ADC_slow()               set ADC slow mode (more accurate)
// ADC_input(PIN)           set ADC input pin (see below for valid pins)
// ADC_read()               sample and read ADC value (0 - 4095)
// ADC_read_VDD()           sample and read VREF, calculate and return VDD in mV
//
// CMP_enable()             enable comparator
// CMP_disable()            disable comparator
// CMP_pos_pin(PIN)         set CMP non-inverting input pin (P37 and ADC input pins only)
// CMP_neg_pin(PIN)         set CMP inverting input pin (P36 only)
// CMP_neg_VREF()           set VREF (1.19V) as inverting input
// CMP_out_pin(PIN)         set CMP output pin (P34, P41 only)
// CMP_out_enable()         enable CMP output on pin
// CMP_out_disable()        disable CMP output on pin
// CMP_out_invert()         invert CMP output
// CMP_out_noninvert()      normal CMP output (*)
// CMP_read()               read CMP output (0: pos < neg, 1: pos > neg, if not inverted)
//
// Notes:
// ------
// (*) default reset state.
// Pins used for PWM should be set as OUTPUT beforehand.
// Not all PWM pins work independently of each other. Refer to the datasheet for more info.
// Pins used for ADC or CMP input must have been set as INPUT (high impedance) beforehand.
// ADC-pins: P00 - P06, P10, P11, P13 - P17, P54.
// If ADC input pins are used for the CMP, ADC and CMP must be enabled.
// Access to extended registers must be granted (P_SW2 |= 0x80;).
//
// 2023 by Stefan Wagner:   https://github.com/wagiminator

#pragma once
#include "stc8h.h"

// ===================================================================================
// Enumerate pin designators (use these designators to define pins)
// ===================================================================================

enum{ P00, P01, P02, P03, P04, P05, P06, P07, P10, P11, P12, P13, P14, P15, P16, P17,
      P20, P21, P22, P23, P24, P25, P26, P27, P30, P31, P32, P33, P34, P35, P36, P37,
      P40, P41, P42, P43, P44, P45, P46, P47, P50, P51, P52, P53, P54, P55, P56, P57,
      P60, P61, P62, P63, P64, P65, P66, P67, P70, P71, P72, P73, P74, P75, P76, P77 };

// ===================================================================================
// Helper Defines (these are for internal use only)
// ===================================================================================

// 2nd-stage glue defines
#define PIN_h_a(PIN) _P##PIN
#define PIN_h_s(PIN) P##PIN

#define PORT_h_bi(PORT, PIN)      (P##PORT##M1 &= ~(1<<PIN), P##PORT##M0 &= ~(1<<PIN))
#define PORT_h_pp(PORT, PIN)      (P##PORT##M1 &= ~(1<<PIN), P##PORT##M0 |=  (1<<PIN))
#define PORT_h_in(PORT, PIN)      (P##PORT##M1 |=  (1<<PIN), P##PORT##M0 &= ~(1<<PIN))
#define PORT_h_od(PORT, PIN)      (P##PORT##M1 |=  (1<<PIN), P##PORT##M0 |=  (1<<PIN))

#define PORT_h_pe(PORT, PIN)      (P##PORT##PU  |=  (1<<<PIN))    // pullup enable
#define PORT_h_pd(PORT, PIN)      (P##PORT##PU  &= ~(1<<<PIN))    // pullup disable
#define PORT_h_sd(PORT, PIN)      (P##PORT##NCS |=  (1<<<PIN))    // schmitt trigger disable
#define PORT_h_se(PORT, PIN)      (P##PORT##NCS &= ~(1<<<PIN))    // schmitt trigger enable
#define PORT_h_ss(PORT, PIN)      (P##PORT##SR  |=  (1<<<PIN))    // slow speed
#define PORT_h_sf(PORT, PIN)      (P##PORT##SR  &= ~(1<<<PIN))    // fast speed
#define PORT_h_dg(PORT, PIN)      (P##PORT##DR  |=  (1<<<PIN))    // general drive current
#define PORT_h_de(PORT, PIN)      (P##PORT##DR  &= ~(1<<<PIN))    // enhanced drive current
#define PORT_h_ie(PORT, PIN)      (P##PORT##IE  |=  (1<<<PIN))    // digital input enable
#define PORT_h_id(PORT, PIN)      (P##PORT##IE  &= ~(1<<<PIN))    // digital input disable

#define PORT_h_l(PORT, PIN)       PP##PORT##PIN = 0
#define PORT_h_h(PORT, PIN)       PP##PORT##PIN = 1
#define PORT_h_t(PORT, PIN)       PP##PORT##PIN = !PP##PORT##PIN
#define PORT_h_r(PORT, PIN)       (PP##PORT##PIN)
#define PORT_h_w(PORT,PIN,val)    PP##PORT##PIN = val

// ===================================================================================
// Set pin as INPUT (high impedance, no pullup)
// ===================================================================================
#define PIN_input(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 &= ~(1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 &= ~(1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 &= ~(1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 &= ~(1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 &= ~(1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 &= ~(1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 &= ~(1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 &= ~(1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

