wagiminator/Development-Boards/STC8H8K64U_DevBoard/software/pwm_fade/include/gpio.h
#define PIN_input_HI    PIN_input
#define PIN_input_FL    PIN_input
#define PIN_input_AN    PIN_input

// ===================================================================================
// Set pin as INPUT with internal 4k1 PULLUP resistor
// ===================================================================================
#define PIN_input_PU(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 &= ~(1<<(PIN&7)), P0PU |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 &= ~(1<<(PIN&7)), P1PU |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 &= ~(1<<(PIN&7)), P2PU |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 &= ~(1<<(PIN&7)), P3PU |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 &= ~(1<<(PIN&7)), P4PU |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 &= ~(1<<(PIN&7)), P5PU |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 &= ~(1<<(PIN&7)), P6PU |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 &= ~(1<<(PIN&7)), P7PU |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set pin as OUTPUT (push-pull)
// ===================================================================================
#define PIN_output(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 &= ~(1<<(PIN&7)), P0M0 |=  (1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 &= ~(1<<(PIN&7)), P1M0 |=  (1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 &= ~(1<<(PIN&7)), P2M0 |=  (1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 &= ~(1<<(PIN&7)), P3M0 |=  (1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 &= ~(1<<(PIN&7)), P4M0 |=  (1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 &= ~(1<<(PIN&7)), P5M0 |=  (1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 &= ~(1<<(PIN&7)), P6M0 |=  (1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 &= ~(1<<(PIN&7)), P7M0 |=  (1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

#define PIN_output_PP   PIN_output

// ===================================================================================
// Set pin as OPEN-DRAIN OUTPUT (no pullup)
// ===================================================================================
#define PIN_output_OD(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 |=  (1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 |=  (1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 |=  (1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 |=  (1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 |=  (1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 |=  (1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 |=  (1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 |=  (1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set pin as OPEN-DRAIN OUTPUT with internal 4k1 PULLUP resistor
// ===================================================================================
#define PIN_output_OD_PU(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 |=  (1<<(PIN&7)), P0M0 |=  (1<<(PIN&7)), P0PU |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 |=  (1<<(PIN&7)), P1M0 |=  (1<<(PIN&7)), P1PU |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 |=  (1<<(PIN&7)), P2M0 |=  (1<<(PIN&7)), P2PU |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 |=  (1<<(PIN&7)), P3M0 |=  (1<<(PIN&7)), P3PU |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 |=  (1<<(PIN&7)), P4M0 |=  (1<<(PIN&7)), P4PU |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 |=  (1<<(PIN&7)), P5M0 |=  (1<<(PIN&7)), P5PU |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 |=  (1<<(PIN&7)), P6M0 |=  (1<<(PIN&7)), P6PU |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 |=  (1<<(PIN&7)), P7M0 |=  (1<<(PIN&7)), P7PU |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set PIN as quasi-bidirectional I/O (weak pull-up)
// ===================================================================================
#define PIN_bidirect(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0M1 &= ~(1<<(PIN&7)), P0M0 &= ~(1<<(PIN&7)), P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1M1 &= ~(1<<(PIN&7)), P1M0 &= ~(1<<(PIN&7)), P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2M1 &= ~(1<<(PIN&7)), P2M0 &= ~(1<<(PIN&7)), P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3M1 &= ~(1<<(PIN&7)), P3M0 &= ~(1<<(PIN&7)), P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4M1 &= ~(1<<(PIN&7)), P4M0 &= ~(1<<(PIN&7)), P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5M1 &= ~(1<<(PIN&7)), P5M0 &= ~(1<<(PIN&7)), P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6M1 &= ~(1<<(PIN&7)), P6M0 &= ~(1<<(PIN&7)), P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7M1 &= ~(1<<(PIN&7)), P7M0 &= ~(1<<(PIN&7)), P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Enable internal 4k1 PULLUP on PIN
// ===================================================================================
#define PIN_pullup(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0PU |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1PU |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2PU |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3PU |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4PU |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5PU |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6PU |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7PU |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Disable internal 4k1 PULLUP on PIN
// ===================================================================================
#define PIN_pulloff(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6PU &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7PU &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set fast level shifting on PIN
// ===================================================================================
#define PIN_fast(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6SR &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7SR &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set slow level shifting on PIN
// ===================================================================================
#define PIN_slow(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0SR |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1SR |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2SR |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3SR |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4SR |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5SR |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6SR |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7SR |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Enable digital input on PIN
// ===================================================================================
#define PIN_enable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0IE |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1IE |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2IE |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3IE |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4IE |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5IE |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6IE |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7IE |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Disable digital input on PIN
// ===================================================================================
#define PIN_disable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6IE &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7IE &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set enhanced drive current ability on PIN
// ===================================================================================
#define PIN_strong(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6DR &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7DR &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Set general drive current ability on PIN
// ===================================================================================
#define PIN_weak(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0DR |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1DR |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2DR |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3DR |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4DR |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5DR |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6DR |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7DR |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Enable schmitt trigger function on PIN
// ===================================================================================
#define PIN_ST_enable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6NCS &= ~(1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7NCS &= ~(1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Disable schmitt trigger function on PIN
// ===================================================================================
#define PIN_ST_disable(PIN) \
  ((PIN>=P00)&&(PIN<=P07) ? (P0NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P10)&&(PIN<=P17) ? (P1NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P20)&&(PIN<=P27) ? (P2NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P30)&&(PIN<=P37) ? (P3NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P40)&&(PIN<=P47) ? (P4NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P50)&&(PIN<=P57) ? (P5NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P60)&&(PIN<=P67) ? (P6NCS |=  (1<<(PIN&7))) : \
  ((PIN>=P70)&&(PIN<=P77) ? (P7NCS |=  (1<<(PIN&7))) : \
(0)))))))))

// ===================================================================================
// Pin manipulation macros
// ===================================================================================
#define PIN_low(PIN)          PIN_h_s(PIN) = 0              // set pin to LOW
#define PIN_high(PIN)         PIN_h_s(PIN) = 1              // set pin to HIGH
#define PIN_toggle(PIN)       PIN_h_s(PIN) = !PIN_h_s(PIN)  // TOGGLE pin
#define PIN_read(PIN)         (PIN_h_s(PIN))                // READ pin
#define PIN_write(PIN, val)   PIN_h_s(PIN) = val            // WRITE pin value

// ===================================================================================
// Convert pin for inline assembly and direct manipulation
// ===================================================================================
#define PIN_asm(PIN)          PIN_h_a(PIN)
#define PIN_set(PIN)          PIN_h_s(PIN)

// ===================================================================================
// (PORT, PIN) manipulation macros
// ===================================================================================
#define PORT_input(PORT, PIN)     PORT_h_i(PORT, PIN)       // set pin as INPUT
#define PORT_input_PU(PORT, PIN)  PORT_h_iP(PORT, PIN)      // set pin as INPUT PULLUP
#define PORT_output(PORT, PIN)    PORT_h_o(PORT, PIN)       // set pin as OUTPUT
#define PORT_output_OD(PORT, PIN) PORT_h_oO(PORT, PIN)      // set pin as OUTPUT OPEN-DRAIN

#define PORT_low(PORT, PIN)       PORT_h_l(PORT, PIN)       // set pin to LOW
#define PORT_high(PORT, PIN)      PORT_h_h(PORT, PIN)       // set pin to HIGH
#define PORT_toggle(PORT, PIN)    PORT_h_t(PORT, PIN)       // TOGGLE pin
#define PORT_read(PORT, PIN)      PORT_h_r(PORT, PIN)       // READ pin
#define PORT_write(PORT,PIN,val)  PORT_h_w(PORT, PIN, val)  // WRITE pin value

// ===================================================================================
// Basic PWM functions
// ===================================================================================

inline void PWM_init() {
  PWMA_CCER1 = 0x00;        // close channels first
  PWMA_CCER2 = 0x00;
  PWMA_CCMR1 = 0x60;        // set PWMA output mode
  PWMA_CCMR2 = 0x60;
  PWMA_CCMR3 = 0x60;
  PWMA_CCMR4 = 0x60;
  PWMA_CCER1 = 0x55;        // re-enable channels
  PWMA_CCER2 = 0x55;
  PWMA_ARRH  = 0x00;        // set period
  PWMA_ARRL  = 0xff;
  PWMA_CCR1H = 0x00;        // clear duty cycle high bytes
  PWMA_CCR2H = 0x00;
  PWMA_CCR3H = 0x00;
  PWMA_CCR4H = 0x00;
  PWMA_BKR   = 0x80;        // enable main output
  PWMA_CR1   = 0x01;        // enable counter
}

